# 플래티넘 이상의 경기에서 핵심 데이터 속성으로 kda, dealt, dpm, dpg, dpd, dtpm, goldearned, kills, object, diffdpg, diffcs, gpm, xpm 을 추출했다. 각 속성은 플레이어의 성과, 팀의 성과, 경기의 흐름 등 다양한 각도에서 종합적으로 나타내기 위해 선택했다. KDA는 플레이어의 종합적인 성과 지표이며, DPM은 지속적인 활약과 피해량 효율을, DPG는 피해량과 획득 골드의 관계를, DPD는 죽음과 입힌 피해량을 나타낸다. Kills는 킬 수를 통해 공격적인 플레이를 측정하고, Object는 오브젝트 통제 여부를 확인할 수 있다. 또한 각 팀의 피해량과 골드 격차를 나타낸 DiffDPG와 DiffCS는 능력 차이와 경기력을 파악하는 데 도움이 되며, GPM과 XPM은 경제적인 성과와 경험치 획득 속도를 평가하는 지표이므로 모두 승패와 연관이 있다. 그리고 승패를 예측하는 것이기 때문에, 경기 데이터를 기준으로 데이터 속성별 정규화(normalize)를 수행했다.
#
#  kda, dealt, dpm, dpg, dpd, dtpm, goldearned, kills, object, diffdpg, diffcs, gpm, xpm
#
#
#
# kda	Kill/Death/Assist의 비율	게임 내에서 플레이어의 성과를 가장 잘 나타내는 지표 중 하나이며, 높은 KDA는 승률과 긍정적인 상관관계가 있다.
# dpd	챔피언에게 넣은 데미지 / 데스 수(데스가 0일경우 챔피언에게 넣은 데미지)	데미지 효율성을 나타내는 지표로, 높은 dpd는 플레이어가 데미지를 효율적으로 가하고 있음을 나타내며, 승률과 긍정적인 상관관계가 있다.
# dpm	챔피언에게 넣은 데미지 / 게임시간	게임 시간당 데미지를 나타내는 지표로, 높은 dpm은 플레이어가 끊임없이 활동하며 데미지를 가하고 있음을 나타내며, 승률과 긍정적인 상관관계가 있다.
# dpg	챔피언에게 넣은 데미지 / 총 사용골드(사용골드가 0일경우 챔피언에게 넣은 데미지)	골드 대비 데미지 효율성을 나타내는 지표로, 높은 dpg는 골드를 효율적으로 사용하고 있음을 나타내며, 승률과 긍정적인 상관관계가 있다.
# dtpm	챔피언에게 받은 데미지 / 게임시간	게임 시간당 받은 데미지를 나타내는 지표로, 낮은 dtpm은 플레이어가 데미지를 효과적으로 피하고 있음을 나타내며, 승률과 긍정적인 상관관계가 있다.
# goldearned (플레이어)	플레이어가 획득한 골드 양	골드는 아이템을 구매하는 데 사용되며, 플레이어의 성능 향상에 중요한 역할을 한다.
# goldearned (팀)	팀 전체가 획득한 골드 양	팀 전체의 골드 양은 팀의 전체적인 성능과 승률에 영향을 미친다.
# turretkills	타워 파괴 횟수	타워를 파괴하는 것은 맵 컨트롤과 골드 획득에 중요하며, 승리로 이어질 가능성이 높다.
# visionscore	시야 점수	시야 점수는 맵의 정보를 얼마나 잘 파악하고 있는지를 나타내며, 이는 승률에 큰 영향을 미친다.
# dragon (플레이어)	플레이어가 처치한 용의 수	용을 처치하면 팀 전체에게 버프를 제공하므로, 용을 많이 처치한 팀이 승리할 가능성이 높다.
# dragon (팀)	팀이 처치한 용의 수	팀 전체가 처치한 용의 수는 팀의 전략적 승리를 나타내며, 승률에 큰 영향을 미친다.
# baron	바론 처치 여부	바론을 처치하면 굉장히 강력한 버프를 얻게 되어, 승리에 큰 도움이 된다.
# kills (플레이어)	플레이어가 처치한 적의 수	적을 많이 처치하면 골드와 경험치를 획득하며, 이는 승률 향상에 도움이 된다.
# deaths (플레이어)	플레이어의 사망 횟수
#
#
#
#
# KDA	Kill/Death/Assist의 비율	전체적인 플레이어 성과를 측정하는 중요한 지표이다.
# Dealt	챔피언에게 넣은 데미지	플레이어가 상대에게 가한 데미지를 나타내어, 전투에서의 기여도를 평가하는 중요한 지표이다.
# Dpm	챔피언에게 넣은 데미지 / 게임시간	플레어어가 분당 평균적으로 입히는 피해를 나타내며, 높은 DPM는 플레이어의 딜링 능력이 뛰어나다는 것을 의미하며, 팀의 전체 딜량에 기여하여 게임에서 유리한 상황을 만들 수 있다.
# Dealttaken	챔피언에게 받은 데미지	플레이어가 상대에게 받은 데미지를 나타내어, 생존 능력과 플레이어의 상대에 대한 내구성을 측정하는 지표이다.
# Diffdpm	DPM 격차	전투에서 팀의 강세를 보여주는 중요한 지표이다.
# Diffgold	팀 간의 Gold 격차	블루, 레드 팀의 경제적 우위를 나타내어 아이템 구매, 경험치, 전투력 등에 영향을 미치며, 큰 차이일수록 전투에서 강세를 보일 수 있다.
# kill_at14	14분 시점의 킬 횟수	게임 초기의 플레이어가 상대를 처치한 횟수로, 초기 승부 요인을 나타낼 수 있다.
# Cs100 / 200	블루(100), 레드(200)팀별 총 CS 수	팀 내 각 플레이어의 골드 획득에 직결되어 아이템 구매와 전투 능력 강화에 중요한 역할을 한다. 높은 CS는 플레이어가 경제적으로 성장하고, 팀 내에서 강력한 존재가 되는 데 도움을 준다.
# Goldearned100 / 200	블루(100), 레드(200)팀별 총 획득 골드	블루, 레드 팀의 전체 경제적 성과를 나타내어 팀의 경제 효율성을 평가하는 중요한 지표이다.
# Dragon100 / 200	블루(100), 레드(200)팀별 총 드래곤 처치 수	드래곤 각 속성은 팀의 전략과 팀워크에 큰 영향을 미치며, 이를 활용하는 것이 게임에서의 승리에 기여하는 중요한 요소이다.
# Baron100 / 200	블루(100), 레드(200)팀별 총 내셔남작 처치 수	바론 버프는 팀의 골드 및 전투 능력을 향상시켜 게임에서 결정적인 우위를 차지할 수 있는 중요한 요소이다.
# Tower100 / 200	블루(100), 레드(200)팀별 총 타워 처치 수	블루, 레드 팀이 처치한 타워 수를 통해 맵 컨트롤과 길의 개방을 확보하여 승패에 긍정적인 영향을 미치는 전략적인 지표이다.
# Visionscore100 / 200	블루(100), 레드(200)팀별 총 시야점수	블루 팀의 시야점수로 팀의 지도 및 시야 확보 능력을 측정하는 지표이며, 팀의 전략적인 우위를 위해 중요한 지역을 통제하며, 이는 게임 승패에 긍정적인 영향을 미친다.
#
#
